app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'naufal'
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getPost()) {
            //laukuan validasi untuk data yang di post
            $data = $this->request->getPost();
            $validate = $this->validation->run($data, 'login');
            $errors = $this->validation->getErrors();

            if ($errors) {
                return view('login');
            }
            $userModel = new \App\Models\UserModel();

            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $user = $userModel->where('username', $username)->first();