app/Controllers/Barang.php

    public function index()
    {
        $barangModel = new \App\Models\BarangModel();
        $barangs = $barangModel->findAll();
---
SELECT *
FROM `barang`