app/Controllers/Etalase.php

SELECT *
FROM `barang`
---
    public function index()
    {
        $barang = new \App\Models\BarangModel();
        $model = $barang->findAll();

SELECT *
FROM `barang`
WHERE `barang`.`id` = '9'
---
    public function beli()
    {
        $id = $this->request->uri->getSegment(3);
        $modelBarang = new \App\Models\BarangModel();
        $modelKomentar = new \App\Models\KomentarModel();
        $komentar = $modelKomentar->where('id_barang', $id)->findAll();
        $model = $modelBarang->find($id);