app/Controllers/Pembayaran.php

SELECT *
FROM `pembayaran`
WHERE `created_by` = '2'
SELECT *
FROM `pembayaran`
---
    public function index()
    {
        $pembayaranModel = new \App\Models\PembayaranModel();
        $user_role = session('role');
        if ($user_role != 0) {

            $user_id = session('id');
            $pembayarans = $pembayaranModel->where('created_by', $user_id)->findAll();
        } else {
            $pembayarans = $pembayaranModel->findAll();